#+STYLE: <link rel="stylesheet" type="text/css" href="stylesheet.css" />
* Org Mode
** What is org mode?
 1. Carsten Dominik
 2. Org for organisation
 3. Day planner
 4. project manager
 5. note taker
 6. mind mapper
 7. Markup
    1. Authoring
    2. export
** Tree Structure
** List [100%]
 - [X] Hello
 - [X] there
** Tables
| Item    | Price | Remaining |
|---------+-------+-----------|
|         |       |      2000 |
| Food    |   300 |      1700 |
| Petrol  |   200 |      1500 |
| Beer    |   100 |      1400 |
| Train   |    50 |      1350 |
| Holiday |   100 |      1250 |
   #+TBLFM: @3$3..@>$3=@-1$3-$2
** Babel
#+begin_src clojurescript :results silent
  (defn some-clj [n] (+ n 1))
#+end_src

#+begin_src clojurescript
  (some-clj 41)
#+end_src

#+RESULTS:
: 42

#+begin_src elisp :results list
  (mapcar (lambda (x) (+ x 1)) '(40 41 42))
#+end_src

#+RESULTS:
- 41
- 42
- 43

#+tblname: fibonacci-inputs
| 1 | 2 | 3 | 4 |  5 |  6 |  7 |  8 |  9 | 10 |
| 2 | 4 | 6 | 8 | 10 | 12 | 14 | 16 | 18 | 20 | 

#+name: fibonacci-seq(fib-inputs=fibonacci-inputs)
#+begin_src emacs-lisp :exports both :tangle fib.el
  (defun fibonacci (n)
    (if (or (= n 0) (= n 1))
        n
      (+ (fibonacci (- n 1)) (fibonacci (- n 2)))))
  
  (mapcar (lambda (row)
            (mapcar #'fibonacci row)) fib-inputs)
#+end_src

#+RESULTS: fibonacci-seq
| 1 | 1 | 2 |  3 |  5 |   8 |  13 |  21 |   34 |   55 |
| 1 | 3 | 8 | 21 | 55 | 144 | 377 | 987 | 2584 | 6765 |

#+begin_src clojurescript
(defn scrape-eb [dojo-date] (+ 20 (rand-int 10)))
#+end_src

#+name: dojo-attendees(x="<2012-08-30 Thu>") 
#+begin_src clojurescript 
  (scrape-eb x)
#+end_src

#+RESULTS: dojo-attendees
: 23

#+tblname: dojo-history
| Dojo Date        | Attendees |
|------------------+-----------|
| <2012-08-28 Tue> |        27 |
| <2012-08-15 Wed> |        21 |
| <2012-09-10 Mon> |        23 |
#+TBLFM: $2='(sbe "dojo-attendees" (x $$1)))

#+name: table-avg(tbl=dojo-history)
#+begin_src clojurescript :exports both
  (/ (reduce + (map second tbl)) (count tbl))
#+end_src

#+RESULTS: table-avg
: 23.666666666666668

